{
    "alarms": [
        {
            "index": 2000,
            "cause": "SOFTWARE_ERROR",
            "name": "RALF_PROCESS_FAIL",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The Ralf process has been restored to normal operation.",
                    "description": "Ralf: Process failure cleared.",
                    "cause": "The Ralf process has been restored to normal operation. The previously issued alarm has been cleared.",
                    "effect": "Normal call detail event recording by the I-CSCF and S-CSCF has been restored.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "Monit has detected that the Ralf process has failed. A restart will automatically be attempted. If this alarm does not clear, the Ralf process may have been stopped or an unrecoverable failure may have occurred.",
                    "description": "Ralf: Process failure.",
                    "cause": "The system has detected that the Ralf process has failed.",
                    "effect": "Call detail event recording may be interrupted and not transmitted to the CDF. If a single Ralf process failed then there is no significant effect to call detail event recording capacity. If multiple Ralf processes fail then call detail event recording capacity will be reduced.",
                    "action": "Monitor for the alarm to clear and confirm that call detail event recording is operating normally. If Ralf does not return to service then contact your support representative."
                }
            ]
        },
        {
            "index": 2001,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "RALF_MEMCACHED_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Ralf communication to at least one Memcached has been restored.",
                    "description": "Ralf: Memcached communication error cleared.",
                    "cause": "Ralf communication to at least one Memcached has been restored. The previously issued alarm has been cleared.",
                    "effect": "Normal call detail event recording by the I-CSCF and S-CSCF has been restored.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "Ralf is unable to contact any Memcacheds. It will periodically attempt to reconnect. If this alarm does not clear, ensure that at least one Memcached is operational and that network connectivity exists between it and Ralf.",
                    "description": "Ralf: Memcached communication error.",
                    "cause": "Ralf is unable to contact any Memcacheds.",
                    "effect": "In progress and new calls can no longer record call detail events and have it reliably transmitted to the CDF. Ralf drops incoming call detail events and logs the error. No caching or queuing of call detail events is provided by Ralf.",
                    "action": "Monitor for this alarm to clear. If this alarm does not clear, ensure that at least one Memcached is operational and that network connectivity exists between it and Ralf. If Memcached does not return to service then contact your support representative."
                }
            ]
        },
        {
            "index": 2002,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "RALF_CHRONOS_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Ralf communication to at least one Chronos has been restored.",
                    "description": "Ralf: Chronos communication error cleared.",
                    "cause": "Ralf communication to at least one Chronos has been restored. The previously issued alarm has been cleared.",
                    "effect": "Normal call detail event recording by the I-CSCF and S-CSCF has been restored.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "Ralf is unable to contact any Chronos's. It will periodically attempt to reconnect. If this alarm does not clear, investigate the health of the Chronos cluster and ensure that at least the local Chronos mode is operational.",
                    "description": "Ralf: Chronos communication error.",
                    "cause": "Ralf is unable to contact any Chronos processes.",
                    "effect": "Ralf will no longer generate Interim messages for active calls. Refer to your CDF vendor's documentation for the CDF behavior under this circumstance. The associated calls will remain active on Clearwater Core even though Interim messages are not being transmitted to the CDF.",
                    "action": "Monitor for this alarm to clear. If this alarm does not clear, ensure that at least one Chronos is operational and that network connectivity exists between it and Ralf. If Chronos does not return to service then contact your support representative."
                }
            ]
        },
        {
            "index": 2003,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "RALF_CDF_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Ralf communication to at least one CDF has been restored.",
                    "description": "Ralf: CDF communication error cleared.",
                    "cause": "Ralf communication to at least one CDF has been restored. The previously issued alarm has been cleared.",
                    "effect": "Normal call detail event recording by the I-CSCF and S-CSCF has been restored.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "Ralf is unable to contact any CDFs. It will periodically attempt to reconnect. If this alarm does not clear, ensure that at least one HSS is operational and that network connectivity exists between it and Ralf.",
                    "description": "Ralf: CDF communication error.",
                    "cause": "Ralf is unable to contact any CDFs.",
                    "effect": "Ralf drops incoming call detail events from the I-CSCF and the S-CSCF and logs the error. No caching or queuing of call detail events occurs. Clearwater Core continues to handle in progress and new calls.",
                    "action": "Monitor for this alarm to clear. If this alarm does not clear, ensure that a CDF is operational and that network connectivity exists between it and Ralf. If the CDF does not return to service then you may need to contact the CDF vendor."
                }
            ]
        },
        {
            "index": 2004,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "RALF_VBUCKET_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Ralf communication to Memcached for a piece of data has been restored.",
                    "description": "Ralf: Memcached vBucket communication error cleared.",
                    "cause": "Ralf communication to Memcached for a vBucket has been restored. The previously issued alarm has been cleared.",
                    "effect": "Normal call detail event recording by the I-CSCF and S-CSCF has been restored.",
                    "action": "No action."
                },
                {
                    "severity": "MAJOR",
                    "details": "Ralf is unable to contact any Memcacheds for a piece of data. Some subscriber data will be unavailable. If this alarm does not clear, ensure that all Memcacheds are operational and that network connectivity exists between them and Ralf.",
                    "description": "Ralf: Memcached vBucket communication error.",
                    "cause": "Ralf is unable to contact any Memcacheds for a vBucket.",
                    "effect": "A subset of the active calls can no longer record call detail events and have it reliably transmitted to the CDF.",
                    "action": "Monitor for this alarm to clear. If this alarm does not clear, ensure that at least one Memcached vBucket is operational and that network connectivity exists between it and Ralf. If Memcached does not return to service then contact your support representative."
                }
            ]
        }
    ]
}
